This change is applied:

```
Terraform will perform the following actions:

  # module.github_actions_s3_backups_assume_role["project-infrastructure"].data.aws_iam_policy_document.backup will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "backup"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "1"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "s3:prefix"
            }
        }
    }

  # module.github_actions_s3_backups_assume_role["project-infrastructure"].data.aws_s3_bucket.bucket will be read during apply
  # (config refers to values not yet known)
 <= data "aws_s3_bucket" "bucket"  {
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.github_actions_s3_backups_assume_role["project-infrastructure"].aws_iam_policy.backup will be created
  + resource "aws_iam_policy" "backup" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "artichoke-project-infrastructure-repo-s3-backup-"
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = {
          + "environment" = "aws"
          + "managed_by"  = "terraform"
          + "project"     = "artichoke-forge"
        }
    }

  # module.github_actions_s3_backups_assume_role["project-infrastructure"].aws_iam_role.github_role will be created
  + resource "aws_iam_role" "github_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + token.actions.githubusercontent.com:sub = "repo:artichoke/project-infrastructure:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::447522982029:oidc-provider/token.actions.githubusercontent.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "gha-project-infrastructure-s3-backup-"
      + path                  = "/"
      + tags_all              = {
          + "environment" = "aws"
          + "managed_by"  = "terraform"
          + "project"     = "artichoke-forge"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.github_actions_s3_backups_assume_role["project-infrastructure"].aws_iam_role_policy_attachment.backup will be created
  + resource "aws_iam_role_policy_attachment" "backup" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.repo_backups.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status                  = (known after apply)
      + acl                                  = (known after apply)
      + arn                                  = (known after apply)
      + bucket                               = "artichoke-forge-github-backups-us-west-2"
      + bucket_domain_name                   = (known after apply)
      + bucket_regional_domain_name          = (known after apply)
      + cors_rule                            = (known after apply)
      + force_destroy                        = false
      + grant                                = (known after apply)
      + hosted_zone_id                       = (known after apply)
      + id                                   = (known after apply)
      + lifecycle_rule                       = (known after apply)
      + logging                              = (known after apply)
      + policy                               = (known after apply)
      + region                               = (known after apply)
      + replication_configuration            = (known after apply)
      + request_payer                        = (known after apply)
      + server_side_encryption_configuration = (known after apply)
      + tags_all                             = {
          + "environment" = "aws"
          + "managed_by"  = "terraform"
          + "project"     = "artichoke-forge"
        }
      + versioning                           = (known after apply)
      + website                              = (known after apply)
      + website_domain                       = (known after apply)
      + website_endpoint                     = (known after apply)

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)
          + rule                = (known after apply)
        }
    }

  # module.repo_backups.aws_s3_bucket_acl.this will be created
  + resource "aws_s3_bucket_acl" "this" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)

      + access_control_policy {
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          + owner {
              + display_name = (known after apply)
              + id           = (known after apply)
            }
        }
    }

  # module.repo_backups.aws_s3_bucket_lifecycle_configuration.this will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + id     = "archive"
          + status = "Enabled"

          + noncurrent_version_transition {
              + noncurrent_days = 30
              + storage_class   = "GLACIER"
            }

          + transition {
              + days          = 30
              + storage_class = "GLACIER_IR"
            }
        }
    }

  # module.repo_backups.aws_s3_bucket_logging.this will be created
  + resource "aws_s3_bucket_logging" "this" {
      + bucket        = (known after apply)
      + id            = (known after apply)
      + target_bucket = (known after apply)
      + target_prefix = "v2/artichoke-forge-github-backups-us-west-2/"
    }

  # module.repo_backups.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.repo_backups.aws_s3_bucket_server_side_encryption_configuration.this will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + kms_master_key_id = (known after apply)
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # module.repo_backups.aws_s3_bucket_versioning.this will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = "Disabled"
          + status     = "Enabled"
        }
    }

  # module.repo_backups_access_logs.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status                  = (known after apply)
      + acl                                  = (known after apply)
      + arn                                  = (known after apply)
      + bucket                               = "artichoke-forge-github-backups-logs-us-west-2"
      + bucket_domain_name                   = (known after apply)
      + bucket_regional_domain_name          = (known after apply)
      + cors_rule                            = (known after apply)
      + force_destroy                        = false
      + grant                                = (known after apply)
      + hosted_zone_id                       = (known after apply)
      + id                                   = (known after apply)
      + lifecycle_rule                       = (known after apply)
      + logging                              = (known after apply)
      + policy                               = (known after apply)
      + region                               = (known after apply)
      + replication_configuration            = (known after apply)
      + request_payer                        = (known after apply)
      + server_side_encryption_configuration = (known after apply)
      + tags_all                             = {
          + "environment" = "aws"
          + "managed_by"  = "terraform"
          + "project"     = "artichoke-forge"
        }
      + versioning                           = (known after apply)
      + website                              = (known after apply)
      + website_domain                       = (known after apply)
      + website_endpoint                     = (known after apply)

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)
          + rule                = (known after apply)
        }
    }

  # module.repo_backups_access_logs.aws_s3_bucket_acl.this will be created
  + resource "aws_s3_bucket_acl" "this" {
      + acl    = "log-delivery-write"
      + bucket = (known after apply)
      + id     = (known after apply)

      + access_control_policy {
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          + owner {
              + display_name = (known after apply)
              + id           = (known after apply)
            }
        }
    }

  # module.repo_backups_access_logs.aws_s3_bucket_lifecycle_configuration.this will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + id     = "archive"
          + status = "Enabled"

          + expiration {
              + days                         = 90
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + noncurrent_days = 60
            }

          + noncurrent_version_transition {
              + noncurrent_days = 30
              + storage_class   = "GLACIER"
            }

          + transition {
              + days          = 30
              + storage_class = "STANDARD_IA"
            }
          + transition {
              + days          = 60
              + storage_class = "GLACIER"
            }
        }
    }

  # module.repo_backups_access_logs.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.repo_backups_access_logs.aws_s3_bucket_server_side_encryption_configuration.this will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + kms_master_key_id = (known after apply)
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # module.repo_backups_access_logs.aws_s3_bucket_versioning.this will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = "Disabled"
          + status     = "Enabled"
        }
    }

  # module.repo_backups.module.kms_key.aws_kms_alias.this will be created
  + resource "aws_kms_alias" "this" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = (known after apply)
      + name_prefix    = "alias/s3-sse-artichoke-forge-github-backups-us-west-2-"
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.repo_backups.module.kms_key.aws_kms_key.this will be created
  + resource "aws_kms_key" "this" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "Key for encrypting artichoke-forge-github-backups-us-west-2 S3 bucket"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags_all                           = {
          + "environment" = "aws"
          + "managed_by"  = "terraform"
          + "project"     = "artichoke-forge"
        }
    }

  # module.repo_backups_access_logs.module.kms_key.aws_kms_alias.this will be created
  + resource "aws_kms_alias" "this" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = (known after apply)
      + name_prefix    = "alias/s3-sse-artichoke-forge-github-backups-logs-us-west-2-"
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.repo_backups_access_logs.module.kms_key.aws_kms_key.this will be created
  + resource "aws_kms_key" "this" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "Key for encrypting artichoke-forge-github-backups-logs-us-west-2 S3 bucket"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags_all                           = {
          + "environment" = "aws"
          + "managed_by"  = "terraform"
          + "project"     = "artichoke-forge"
        }
    }

Plan: 20 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + github_actions_s3_backup_assume_role_arn = {
      + project-infrastructure = (known after apply)
    }

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.repo_backups.module.kms_key.aws_kms_key.this: Creating...
module.repo_backups_access_logs.module.kms_key.aws_kms_key.this: Creating...
module.github_actions_s3_backups_assume_role["project-infrastructure"].aws_iam_role.github_role: Creating...
module.repo_backups_access_logs.aws_s3_bucket.this: Creating...
module.repo_backups.aws_s3_bucket.this: Creating...
module.github_actions_s3_backups_assume_role["project-infrastructure"].aws_iam_role.github_role: Creation complete after 3s [id=gha-project-infrastructure-s3-backup-20220220212010997600000001]
module.repo_backups_access_logs.module.kms_key.aws_kms_key.this: Still creating... [10s elapsed]
module.repo_backups.module.kms_key.aws_kms_key.this: Still creating... [10s elapsed]
module.repo_backups.aws_s3_bucket.this: Still creating... [10s elapsed]
module.repo_backups_access_logs.aws_s3_bucket.this: Still creating... [10s elapsed]
module.repo_backups.module.kms_key.aws_kms_key.this: Creation complete after 11s [id=09f0dca9-124c-404f-bc3e-4c38d403f551]
module.repo_backups.module.kms_key.aws_kms_alias.this: Creating...
module.repo_backups_access_logs.module.kms_key.aws_kms_key.this: Creation complete after 11s [id=e8424b14-bb83-4e11-bc96-2f63d1a16031]
module.repo_backups_access_logs.module.kms_key.aws_kms_alias.this: Creating...
module.repo_backups.module.kms_key.aws_kms_alias.this: Creation complete after 0s [id=alias/s3-sse-artichoke-forge-github-backups-us-west-2-20220220212021571300000002]
module.repo_backups_access_logs.module.kms_key.aws_kms_alias.this: Creation complete after 0s [id=alias/s3-sse-artichoke-forge-github-backups-logs-us-west-2-20220220212021793400000003]
module.repo_backups.aws_s3_bucket.this: Creation complete after 16s [id=artichoke-forge-github-backups-us-west-2]
module.github_actions_s3_backups_assume_role["project-infrastructure"].data.aws_s3_bucket.bucket: Reading...
module.repo_backups.aws_s3_bucket_public_access_block.this: Creating...
module.repo_backups.aws_s3_bucket_acl.this: Creating...
module.repo_backups.aws_s3_bucket_versioning.this: Creating...
module.repo_backups.aws_s3_bucket_server_side_encryption_configuration.this: Creating...
module.repo_backups_access_logs.aws_s3_bucket.this: Creation complete after 16s [id=artichoke-forge-github-backups-logs-us-west-2]
module.repo_backups.aws_s3_bucket_lifecycle_configuration.this: Creating...
module.repo_backups_access_logs.aws_s3_bucket_versioning.this: Creating...
module.repo_backups_access_logs.aws_s3_bucket_acl.this: Creating...
module.repo_backups_access_logs.aws_s3_bucket_server_side_encryption_configuration.this: Creating...
module.repo_backups_access_logs.aws_s3_bucket_lifecycle_configuration.this: Creating...
module.repo_backups.aws_s3_bucket_acl.this: Creation complete after 2s [id=artichoke-forge-github-backups-us-west-2,private]
module.repo_backups_access_logs.aws_s3_bucket_public_access_block.this: Creating...
module.repo_backups_access_logs.aws_s3_bucket_acl.this: Creation complete after 2s [id=artichoke-forge-github-backups-logs-us-west-2,log-delivery-write]
module.repo_backups.aws_s3_bucket_logging.this: Creating...
module.github_actions_s3_backups_assume_role["project-infrastructure"].data.aws_s3_bucket.bucket: Read complete after 2s [id=artichoke-forge-github-backups-us-west-2]
module.github_actions_s3_backups_assume_role["project-infrastructure"].data.aws_iam_policy_document.backup: Reading...
module.github_actions_s3_backups_assume_role["project-infrastructure"].data.aws_iam_policy_document.backup: Read complete after 0s [id=2388416313]
module.github_actions_s3_backups_assume_role["project-infrastructure"].aws_iam_policy.backup: Creating...
module.repo_backups.aws_s3_bucket_public_access_block.this: Creation complete after 2s [id=artichoke-forge-github-backups-us-west-2]
module.repo_backups.aws_s3_bucket_logging.this: Creation complete after 1s [id=artichoke-forge-github-backups-us-west-2]
module.repo_backups_access_logs.aws_s3_bucket_public_access_block.this: Creation complete after 1s [id=artichoke-forge-github-backups-logs-us-west-2]
module.repo_backups.aws_s3_bucket_server_side_encryption_configuration.this: Creation complete after 3s [id=artichoke-forge-github-backups-us-west-2]
module.repo_backups_access_logs.aws_s3_bucket_server_side_encryption_configuration.this: Creation complete after 3s [id=artichoke-forge-github-backups-logs-us-west-2]
module.repo_backups_access_logs.aws_s3_bucket_lifecycle_configuration.this: Creation complete after 3s [id=artichoke-forge-github-backups-logs-us-west-2]
module.github_actions_s3_backups_assume_role["project-infrastructure"].aws_iam_policy.backup: Creation complete after 2s [id=arn:aws:iam::447522982029:policy/artichoke-project-infrastructure-repo-s3-backup-20220220212028825800000004]
module.github_actions_s3_backups_assume_role["project-infrastructure"].aws_iam_role_policy_attachment.backup: Creating...
module.repo_backups.aws_s3_bucket_lifecycle_configuration.this: Creation complete after 4s [id=artichoke-forge-github-backups-us-west-2]
module.github_actions_s3_backups_assume_role["project-infrastructure"].aws_iam_role_policy_attachment.backup: Creation complete after 0s [id=gha-project-infrastructure-s3-backup-20220220212010997600000001-20220220212030968700000005]
module.repo_backups.aws_s3_bucket_versioning.this: Creation complete after 4s [id=artichoke-forge-github-backups-us-west-2]
module.repo_backups_access_logs.aws_s3_bucket_versioning.this: Creation complete after 4s [id=artichoke-forge-github-backups-logs-us-west-2]

Apply complete! Resources: 20 added, 0 changed, 0 destroyed.

Outputs:

github_actions_project_infrastructure_assume_role_arn = "arn:aws:iam::447522982029:role/gha-project-infrastructure-s3-ro-20220212013048188700000001"
github_actions_s3_backup_assume_role_arn = {
  "project-infrastructure" = "arn:aws:iam::447522982029:role/gha-project-infrastructure-s3-backup-20220220212010997600000001"
}
```